"""
Ввести строку с клавиатуры.

2. Создать строку равную предпоследнему символу введенной строки.
"""

string = input("Enter your string: ")
print(string[-2])