"""
 Ввести строку с клавиатуры.
1. Создать строку равную третьему символу введенной строки
"""

string = input("Enter a string: ")
print(string[2])