"""
Ввести строку с клавиатуры.
3. Создать строку равную первым пяти символам введенной строки.
"""

string = input("Enter a string: ")
print(string[0:5])