"""
Даны 2 действительных числа a и b. Получить их сумму, разность и
произведение.
"""

a = 10
b = 5

sum = a + b
subtraction = a - b
multiplication = a * b

print(sum)
print(subtraction)
print(multiplication)