"""
Дана длина ребра куба. Найти объем куба и площадь его боковой
поверхности.
"""

length = 10
value = length ** 3
print(value)

square = 4 * (length ** 2)
print(square)