"""
Дана длина ребра куба. Найти объем куба и площадь его боковой
поверхности.
"""

length = 10
V = length ** 3
print(V)

SA = 4 * (length ** 2)
print(SA)