"""
2. Даны действительные числа x и y. Получить 1+ |xy|
"""

x = 27
y = 3

result = (x-y) / (1 + (x * y))
print(result)