"""
 Ввести строку с клавиатуры.
4. Создать строку равную введенной строку без последних двух символов.
"""

string = input("Enter your string: ")
print(string[0:-2])